>## Assignment 2: Pandas Challenge

>*Sofiya Ibrayeva*

>**01.30.2024**

In [40]:
import pandas as pd

In [41]:
data1 = {'Sofiya': [95, 91, 60], 'Raad': [94,74, 84], 'Alex':[77,70, 93]}

In [42]:
type(data1)

dict

In [43]:
df_1 = pd.DataFrame(data1)
df_1

   Sofiya  Raad  Alex
0      95    94    77
1      91    74    70
2      60    84    93

In [44]:
new_index_mapping = {0: 'class 1', 1: 'class 2', 2: 'class 3'}
df_reindexed = df_1.rename(index=new_index_mapping)
table_heading = "Student Grades"
df_reindexed.columns.name = table_heading

In [45]:
df=pd.DataFrame(df_reindexed)
df

Student Grades  Sofiya  Raad  Alex
class 1             95    94    77
class 2             91    74    70
class 3             60    84    93

In [46]:
len(df)

3

In [47]:
df.head()

Student Grades  Sofiya  Raad  Alex
class 1             95    94    77
class 2             91    74    70
class 3             60    84    93

In [48]:
df.head(2)

Student Grades  Sofiya  Raad  Alex
class 1             95    94    77
class 2             91    74    70

In [49]:
df.index

Index(['class 1', 'class 2', 'class 3'], dtype='object')

In [50]:
len(df.index)

3

In [51]:
df.iloc[0]

Student Grades
Sofiya    95
Raad      94
Alex      77
Name: class 1, dtype: int64

In [52]:
df['Sofiya']

class 1    95
class 2    91
class 3    60
Name: Sofiya, dtype: int64

In [53]:
df.to_csv('Ibrayeva_PandasChallenge.csv')

In [54]:
ls

Ibrayeva_PandasChallenge.csv  cces_example_data.csv
PandasInClass_Ibrayeva.ipynb  ibrayeva_SystemsCheck.ipynb
Untitled.ipynb                subset_cces_example_data.csv

## Why are dynamic, interactive data visualizations useful when communicating data?

* The main reason why interactive data is so popular nowadays is because it increases engagement with the audience. By providing different tools, users can explore the data at their own pace. Some people are only interested in an overview point of the data, meanwhile others are looking for specific points. Dynamic interactive data provides solutions for both of these groups. 
* Moreover, representing big datasets could be difficult on a static image due to the space limitation. Interactive data visualization addresses this issue by offering tools like filtering, pop-up text blocks, and other dynamic elements that enable users to navigate and explore big amounts of data.
* With the right design choices, interactive data sets usually have more audience attention due to its dynamic animation and storytelling.